app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Post One"], ["body", "This is post one"], ["created_at", "2019-03-19 11:28:17.699913"], ["updated_at", "2019-03-19 11:28:17.699913"]]
---
    def create
        # render plain: params[:post].inspect
        @post = Post.new(post_params)

        if @post.save